{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_1", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 6], "dtype": "float32", "sparse": false, "name": "input_layer"}, "registered_name": null, "name": "input_layer", "inbound_nodes": []}, {"module": null, "class_name": "mea_column_model_customnormform_json", "config": {"name": "mea_column_model_customnormform_json", "trainable": true, "dtype": "float32", "n_hidden": 1, "n_neurons": 12, "layer_act": "relu", "out_act": "sigmoid", "input_labels": ["FGIN (kg/hr)", "FGIN_CO2MASSFRAC", "SOLVENTIN (kg/hr)", "STRIPPER_PRESSURE (kPa)", "SOLVENTAMINECONC", "SOLVENTCO2LOADING"], "output_labels": ["CO2CAPTUREPERC", "SRD (MJ/kg CO2)"], "input_bounds": {"FGIN (kg/hr)": [2002.093156, 2997.550391], "FGIN_CO2MASSFRAC": [0.173247, 0.209875], "SOLVENTIN (kg/hr)": [4520.580362, 6998.670255], "STRIPPER_PRESSURE (kPa)": [180.053567, 199.892992], "SOLVENTAMINECONC": [0.281119, 0.349613], "SOLVENTCO2LOADING": [0.100575, 0.298701]}, "output_bounds": {"CO2CAPTUREPERC": [38.693483, 99.985725], "SRD (MJ/kg CO2)": [3.201686, 7.785684]}, "normalized": true, "normalization_form": "Custom", "normalization_function": "(datavalue - dataminimum)/(datamaximum - dataminimum)"}, "registered_name": "Custom>mea_column_model_customnormform_json", "build_config": {"input_shape": [null, 6]}, "name": "mea_column_model_customnormform_json", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["mea_column_model_customnormform_json", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"optimizer": "RMSprop", "loss": "mse", "loss_weights": null, "metrics": ["mae", "mse"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}}