{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Custom>mea_column_model_customnormform_json", "config": {"name": "mea_column_model_customnormform_json", "trainable": true, "dtype": "float32", "n_hidden": 1, "n_neurons": 12, "layer_act": "relu", "out_act": "sigmoid", "input_labels": ["FGIN (kg/hr)", "FGIN_CO2MASSFRAC", "SOLVENTIN (kg/hr)", "STRIPPER_PRESSURE (kPa)", "SOLVENTAMINECONC", "SOLVENTCO2LOADING"], "output_labels": ["CO2CAPTUREPERC", "SRD (MJ/kg CO2)"], "input_bounds": {"FGIN (kg/hr)": [2002.093156, 2997.550391], "FGIN_CO2MASSFRAC": [0.173247, 0.209875], "SOLVENTIN (kg/hr)": [4520.580362, 6998.670255], "STRIPPER_PRESSURE (kPa)": [180.053567, 199.892992], "SOLVENTAMINECONC": [0.281119, 0.349613], "SOLVENTCO2LOADING": [0.100575, 0.298701]}, "output_bounds": {"CO2CAPTUREPERC": [38.693483, 99.985725], "SRD (MJ/kg CO2)": [3.201686, 7.785684]}, "normalized": true, "normalization_form": "Custom", "normalization_function": "(datavalue - dataminimum)/(datamaximum - dataminimum)"}, "name": "mea_column_model_customnormform_json", "inbound_nodes": [[["input_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["mea_column_model_customnormform_json", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}